package JavaSE_OOP_Learn.src;

/*
    现实世界中事如何描述一个事物的？
        举例：学生
            姓名，年龄，性别...
            学习，吃饭，睡觉...


        属性：该事物的描述信息
        行为：该事物能做什么

    学习编程语言是为了模拟现实世界的事物
    而Java中最基本的单位是：类
    所以我们应该把事物通过类来体现出来
    由此我们就得到了现实世界事物和类的对应关系

    事物：                    类：
        属性                      成员变量
        行为                      成员方法

    类：是一组相关的属性和行为的集合，是一个抽象的概念。
    对象：是该类事物的具体表现形式，具体存在的个体

    举例：
        学生：类
        人：对象
* */
public class Class_Object_1 {
    public static void main(String[] args) {

    }
}
